###############################################################################
# Created by write_sdc
###############################################################################
current_design rv32i_cpu
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 25.0000 [get_ports {clk}]
set_clock_uncertainty 0.5000 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_rdata_0}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_rdata_1}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_rdata_10}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_rdata_11}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_rdata_12}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_rdata_13}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_rdata_14}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_rdata_15}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_rdata_16}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_rdata_17}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_rdata_18}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_rdata_19}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_rdata_2}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_rdata_20}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_rdata_21}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_rdata_22}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_rdata_23}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_rdata_24}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_rdata_25}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_rdata_26}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_rdata_27}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_rdata_28}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_rdata_29}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_rdata_3}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_rdata_30}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_rdata_31}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_rdata_4}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_rdata_5}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_rdata_6}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_rdata_7}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_rdata_8}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_rdata_9}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_ready}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_rdata_0}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_rdata_1}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_rdata_10}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_rdata_11}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_rdata_12}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_rdata_13}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_rdata_14}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_rdata_15}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_rdata_16}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_rdata_17}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_rdata_18}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_rdata_19}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_rdata_2}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_rdata_20}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_rdata_21}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_rdata_22}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_rdata_23}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_rdata_24}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_rdata_25}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_rdata_26}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_rdata_27}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_rdata_28}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_rdata_29}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_rdata_3}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_rdata_30}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_rdata_31}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_rdata_4}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_rdata_5}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_rdata_6}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_rdata_7}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_rdata_8}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_rdata_9}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_ready}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rst_n}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_addr_0}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_addr_1}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_addr_10}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_addr_11}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_addr_12}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_addr_13}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_addr_14}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_addr_15}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_addr_16}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_addr_17}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_addr_18}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_addr_19}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_addr_2}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_addr_20}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_addr_21}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_addr_22}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_addr_23}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_addr_24}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_addr_25}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_addr_26}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_addr_27}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_addr_28}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_addr_29}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_addr_3}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_addr_30}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_addr_31}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_addr_4}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_addr_5}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_addr_6}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_addr_7}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_addr_8}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_addr_9}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_req}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_wdata_0}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_wdata_1}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_wdata_10}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_wdata_11}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_wdata_12}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_wdata_13}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_wdata_14}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_wdata_15}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_wdata_16}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_wdata_17}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_wdata_18}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_wdata_19}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_wdata_2}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_wdata_20}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_wdata_21}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_wdata_22}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_wdata_23}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_wdata_24}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_wdata_25}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_wdata_26}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_wdata_27}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_wdata_28}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_wdata_29}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_wdata_3}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_wdata_30}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_wdata_31}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_wdata_4}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_wdata_5}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_wdata_6}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_wdata_7}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_wdata_8}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_wdata_9}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_wstrb_0}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_wstrb_1}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_wstrb_2}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dmem_wstrb_3}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_addr_0}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_addr_1}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_addr_10}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_addr_11}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_addr_12}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_addr_13}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_addr_14}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_addr_15}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_addr_16}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_addr_17}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_addr_18}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_addr_19}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_addr_2}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_addr_20}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_addr_21}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_addr_22}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_addr_23}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_addr_24}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_addr_25}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_addr_26}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_addr_27}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_addr_28}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_addr_29}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_addr_3}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_addr_30}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_addr_31}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_addr_4}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_addr_5}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_addr_6}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_addr_7}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_addr_8}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_addr_9}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {imem_req}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0500 [get_ports {dmem_addr_0}]
set_load -pin_load 0.0500 [get_ports {dmem_addr_1}]
set_load -pin_load 0.0500 [get_ports {dmem_addr_10}]
set_load -pin_load 0.0500 [get_ports {dmem_addr_11}]
set_load -pin_load 0.0500 [get_ports {dmem_addr_12}]
set_load -pin_load 0.0500 [get_ports {dmem_addr_13}]
set_load -pin_load 0.0500 [get_ports {dmem_addr_14}]
set_load -pin_load 0.0500 [get_ports {dmem_addr_15}]
set_load -pin_load 0.0500 [get_ports {dmem_addr_16}]
set_load -pin_load 0.0500 [get_ports {dmem_addr_17}]
set_load -pin_load 0.0500 [get_ports {dmem_addr_18}]
set_load -pin_load 0.0500 [get_ports {dmem_addr_19}]
set_load -pin_load 0.0500 [get_ports {dmem_addr_2}]
set_load -pin_load 0.0500 [get_ports {dmem_addr_20}]
set_load -pin_load 0.0500 [get_ports {dmem_addr_21}]
set_load -pin_load 0.0500 [get_ports {dmem_addr_22}]
set_load -pin_load 0.0500 [get_ports {dmem_addr_23}]
set_load -pin_load 0.0500 [get_ports {dmem_addr_24}]
set_load -pin_load 0.0500 [get_ports {dmem_addr_25}]
set_load -pin_load 0.0500 [get_ports {dmem_addr_26}]
set_load -pin_load 0.0500 [get_ports {dmem_addr_27}]
set_load -pin_load 0.0500 [get_ports {dmem_addr_28}]
set_load -pin_load 0.0500 [get_ports {dmem_addr_29}]
set_load -pin_load 0.0500 [get_ports {dmem_addr_3}]
set_load -pin_load 0.0500 [get_ports {dmem_addr_30}]
set_load -pin_load 0.0500 [get_ports {dmem_addr_31}]
set_load -pin_load 0.0500 [get_ports {dmem_addr_4}]
set_load -pin_load 0.0500 [get_ports {dmem_addr_5}]
set_load -pin_load 0.0500 [get_ports {dmem_addr_6}]
set_load -pin_load 0.0500 [get_ports {dmem_addr_7}]
set_load -pin_load 0.0500 [get_ports {dmem_addr_8}]
set_load -pin_load 0.0500 [get_ports {dmem_addr_9}]
set_load -pin_load 0.0500 [get_ports {dmem_req}]
set_load -pin_load 0.0500 [get_ports {dmem_wdata_0}]
set_load -pin_load 0.0500 [get_ports {dmem_wdata_1}]
set_load -pin_load 0.0500 [get_ports {dmem_wdata_10}]
set_load -pin_load 0.0500 [get_ports {dmem_wdata_11}]
set_load -pin_load 0.0500 [get_ports {dmem_wdata_12}]
set_load -pin_load 0.0500 [get_ports {dmem_wdata_13}]
set_load -pin_load 0.0500 [get_ports {dmem_wdata_14}]
set_load -pin_load 0.0500 [get_ports {dmem_wdata_15}]
set_load -pin_load 0.0500 [get_ports {dmem_wdata_16}]
set_load -pin_load 0.0500 [get_ports {dmem_wdata_17}]
set_load -pin_load 0.0500 [get_ports {dmem_wdata_18}]
set_load -pin_load 0.0500 [get_ports {dmem_wdata_19}]
set_load -pin_load 0.0500 [get_ports {dmem_wdata_2}]
set_load -pin_load 0.0500 [get_ports {dmem_wdata_20}]
set_load -pin_load 0.0500 [get_ports {dmem_wdata_21}]
set_load -pin_load 0.0500 [get_ports {dmem_wdata_22}]
set_load -pin_load 0.0500 [get_ports {dmem_wdata_23}]
set_load -pin_load 0.0500 [get_ports {dmem_wdata_24}]
set_load -pin_load 0.0500 [get_ports {dmem_wdata_25}]
set_load -pin_load 0.0500 [get_ports {dmem_wdata_26}]
set_load -pin_load 0.0500 [get_ports {dmem_wdata_27}]
set_load -pin_load 0.0500 [get_ports {dmem_wdata_28}]
set_load -pin_load 0.0500 [get_ports {dmem_wdata_29}]
set_load -pin_load 0.0500 [get_ports {dmem_wdata_3}]
set_load -pin_load 0.0500 [get_ports {dmem_wdata_30}]
set_load -pin_load 0.0500 [get_ports {dmem_wdata_31}]
set_load -pin_load 0.0500 [get_ports {dmem_wdata_4}]
set_load -pin_load 0.0500 [get_ports {dmem_wdata_5}]
set_load -pin_load 0.0500 [get_ports {dmem_wdata_6}]
set_load -pin_load 0.0500 [get_ports {dmem_wdata_7}]
set_load -pin_load 0.0500 [get_ports {dmem_wdata_8}]
set_load -pin_load 0.0500 [get_ports {dmem_wdata_9}]
set_load -pin_load 0.0500 [get_ports {dmem_wstrb_0}]
set_load -pin_load 0.0500 [get_ports {dmem_wstrb_1}]
set_load -pin_load 0.0500 [get_ports {dmem_wstrb_2}]
set_load -pin_load 0.0500 [get_ports {dmem_wstrb_3}]
set_load -pin_load 0.0500 [get_ports {imem_addr_0}]
set_load -pin_load 0.0500 [get_ports {imem_addr_1}]
set_load -pin_load 0.0500 [get_ports {imem_addr_10}]
set_load -pin_load 0.0500 [get_ports {imem_addr_11}]
set_load -pin_load 0.0500 [get_ports {imem_addr_12}]
set_load -pin_load 0.0500 [get_ports {imem_addr_13}]
set_load -pin_load 0.0500 [get_ports {imem_addr_14}]
set_load -pin_load 0.0500 [get_ports {imem_addr_15}]
set_load -pin_load 0.0500 [get_ports {imem_addr_16}]
set_load -pin_load 0.0500 [get_ports {imem_addr_17}]
set_load -pin_load 0.0500 [get_ports {imem_addr_18}]
set_load -pin_load 0.0500 [get_ports {imem_addr_19}]
set_load -pin_load 0.0500 [get_ports {imem_addr_2}]
set_load -pin_load 0.0500 [get_ports {imem_addr_20}]
set_load -pin_load 0.0500 [get_ports {imem_addr_21}]
set_load -pin_load 0.0500 [get_ports {imem_addr_22}]
set_load -pin_load 0.0500 [get_ports {imem_addr_23}]
set_load -pin_load 0.0500 [get_ports {imem_addr_24}]
set_load -pin_load 0.0500 [get_ports {imem_addr_25}]
set_load -pin_load 0.0500 [get_ports {imem_addr_26}]
set_load -pin_load 0.0500 [get_ports {imem_addr_27}]
set_load -pin_load 0.0500 [get_ports {imem_addr_28}]
set_load -pin_load 0.0500 [get_ports {imem_addr_29}]
set_load -pin_load 0.0500 [get_ports {imem_addr_3}]
set_load -pin_load 0.0500 [get_ports {imem_addr_30}]
set_load -pin_load 0.0500 [get_ports {imem_addr_31}]
set_load -pin_load 0.0500 [get_ports {imem_addr_4}]
set_load -pin_load 0.0500 [get_ports {imem_addr_5}]
set_load -pin_load 0.0500 [get_ports {imem_addr_6}]
set_load -pin_load 0.0500 [get_ports {imem_addr_7}]
set_load -pin_load 0.0500 [get_ports {imem_addr_8}]
set_load -pin_load 0.0500 [get_ports {imem_addr_9}]
set_load -pin_load 0.0500 [get_ports {imem_req}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmem_rdata_0}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmem_rdata_1}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmem_rdata_10}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmem_rdata_11}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmem_rdata_12}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmem_rdata_13}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmem_rdata_14}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmem_rdata_15}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmem_rdata_16}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmem_rdata_17}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmem_rdata_18}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmem_rdata_19}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmem_rdata_2}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmem_rdata_20}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmem_rdata_21}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmem_rdata_22}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmem_rdata_23}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmem_rdata_24}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmem_rdata_25}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmem_rdata_26}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmem_rdata_27}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmem_rdata_28}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmem_rdata_29}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmem_rdata_3}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmem_rdata_30}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmem_rdata_31}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmem_rdata_4}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmem_rdata_5}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmem_rdata_6}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmem_rdata_7}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmem_rdata_8}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmem_rdata_9}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {dmem_ready}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {imem_rdata_0}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {imem_rdata_1}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {imem_rdata_10}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {imem_rdata_11}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {imem_rdata_12}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {imem_rdata_13}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {imem_rdata_14}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {imem_rdata_15}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {imem_rdata_16}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {imem_rdata_17}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {imem_rdata_18}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {imem_rdata_19}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {imem_rdata_2}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {imem_rdata_20}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {imem_rdata_21}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {imem_rdata_22}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {imem_rdata_23}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {imem_rdata_24}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {imem_rdata_25}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {imem_rdata_26}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {imem_rdata_27}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {imem_rdata_28}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {imem_rdata_29}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {imem_rdata_3}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {imem_rdata_30}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {imem_rdata_31}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {imem_rdata_4}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {imem_rdata_5}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {imem_rdata_6}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {imem_rdata_7}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {imem_rdata_8}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {imem_rdata_9}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {imem_ready}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst_n}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition 1.5000 [current_design]
set_max_fanout 10.0000 [current_design]
